app/Models/Model_auth.php

    public function login($username, $password)
    {
        return $this->db->table('tbl_user')
            ->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'bhaktiragil@gmail.com'
AND `password` = 'bhakti123j'